Masmiseim36/nxpSDK/middleware/wireless/framework_5.4.6/LowPower/Source/MKW36Z/PWR.c
const pfHandleDeepSleepFunc_t maHandleDeepSleep[] =
{
#if cPWR_EnableDeepSleepMode_1
    PWR_HandleDeepSleepMode_1,
#else
    (pfHandleDeepSleepFunc_t)0,
#endif
#if cPWR_EnableDeepSleepMode_2
    PWR_HandleDeepSleepMode_2_3,
#else
    (pfHandleDeepSleepFunc_t)0,
#endif
#if cPWR_EnableDeepSleepMode_3
    PWR_HandleDeepSleepMode_2_3,
#else
    (pfHandleDeepSleepFunc_t)0,
#endif
#if cPWR_EnableDeepSleepMode_4
    PWR_HandleDeepSleepMode_4,
#else
    (pfHandleDeepSleepFunc_t)0,
#endif
#if cPWR_EnableDeepSleepMode_5
    PWR_HandleDeepSleepMode_5,
#else
    (pfHandleDeepSleepFunc_t)0,
#endif
#if cPWR_EnableDeepSleepMode_6
    PWR_HandleDeepSleepMode_6,
#else
    (pfHandleDeepSleepFunc_t)0,
#endif
#if cPWR_EnableDeepSleepMode_7
    PWR_HandleDeepSleepMode_7,
#else
    (pfHandleDeepSleepFunc_t)0,
#endif
#if cPWR_EnableDeepSleepMode_8
    PWR_HandleDeepSleepMode_8,
#else
    (pfHandleDeepSleepFunc_t)0,
#endif
};

static pfPWRCallBack_t gpfPWR_LowPowerEnterCb;
static pfPWRCallBack_t gpfPWR_LowPowerExitCb;

AT_WARMBOOTCONFIG_SECTION(warmboot_config_t warmbootConfig);
#endif /* (cPWR_UsePowerDownMode) */

/*****************************************************************************
 *                             PRIVATE FUNCTIONS                             *
 *---------------------------------------------------------------------------*
 * Add to this section all the functions that have local (file) scope.       *
 * These functions cannot be accessed outside this module.                   *
 * These definitions shall be preceded by the 'static' keyword.              *
 *---------------------------------------------------------------------------*
 *****************************************************************************/
/*---------------------------------------------------------------------------
 * Name: PWR_GenfskGetDsmDurationMs
 * Description: -
 * Parameters: -
 * Return: -
 *---------------------------------------------------------------------------*/
#if ((cPWR_UsePowerDownMode) && (cPWR_GENFSK_LL_Enable))
#if defined(__IAR_SYSTEMS_ICC__)
__weak uint32_t PWR_GenfskGetDsmDurationMs(void)
#elif defined(__GNUC__)
__attribute__((weak)) uint32_t PWR_GenfskGetDsmDurationMs(void)
#endif
{
     return mPWR_DeepSleepTimeMs >> 3;
}
#endif /* ((cPWR_UsePowerDownMode) && (cPWR_GENFSK_LL_Enable)) */

/*---------------------------------------------------------------------------
 * Name: PWR_GENFSK_EnterDSM
 * Description: -
 * Parameters: -
 * Return: -
 *---------------------------------------------------------------------------*/
bool_t PWR_GENFSK_EnterDSM(uint32_t dsmDuration)
{
#if ((cPWR_UsePowerDownMode) && (cPWR_GENFSK_LL_Enable))
    uint32_t dsmOscOffset;
    uint64_t durationInDsmTicks;

    /* Compute the duration in 32.768KHz ticks. */
    durationInDsmTicks = (dsmDuration << 15)/1000;

    if(durationInDsmTicks > mPWR_DSM_TimerMask_c)
    {
        durationInDsmTicks = mPWR_DSM_TimerMask_c;
    }

    dsmOscOffset = 1024 << READ_REGISTER_FIELD(RSIM->RF_OSC_CTRL,RSIM_RF_OSC_CTRL_BB_XTAL_READY_COUNT_SEL);
    dsmOscOffset = (dsmOscOffset << 15)/BOARD_BOOTCLOCKRUN_CORE_CLOCK;

    if(durationInDsmTicks > dsmOscOffset)
    {
        uint32_t dsmSleep;

        RSIM->DSM_OSC_OFFSET = dsmOscOffset;  /* Set the DSM oscillator offset. */
        dsmSleep = (RSIM->DSM_TIMER + 5) & mPWR_DSM_TimerMask_c;  /* Compute the sleep time. No fewer than 4 clocks greater than DSM_TIMER. */
        RSIM->GEN_SLEEP = dsmSleep;
        mPWR_AbsoluteWakeupTimeInDsmTicks = (dsmSleep + durationInDsmTicks) & mPWR_DSM_TimerMask_c;  /* Compute wake-up time. */
        RSIM->GEN_WAKE = mPWR_AbsoluteWakeupTimeInDsmTicks;
        GENFSK->DSM_CTRL = GENFSK_DSM_CTRL_GEN_SLEEP_REQUEST_MASK;  /* Enter DSM */
    }
    else
    {
        mPWR_AbsoluteWakeupTimeInDsmTicks = mPWR_DSM_InvalidTime_c;

        return FALSE;
    }

    return TRUE;
#else
    return FALSE;
#endif /* ((cPWR_UsePowerDownMode) && (cPWR_GENFSK_LL_Enable)) */
}

/*---------------------------------------------------------------------------
 * Name: PWR_HandleGenfskDsmEnter
 * Description: -
 * Parameters: -
 * Return: -
 *---------------------------------------------------------------------------*/
#if ((cPWR_UsePowerDownMode) && (cPWR_GENFSK_LL_Enable))
static bool_t PWR_HandleGenfskDsmEnter(void)
{
    uint32_t currentDsmTime;
    uint32_t dsmOscOffset;
    uint32_t durationInDsmTicks = 0;
    bool_t retVal = FALSE;

    currentDsmTime = RSIM->DSM_TIMER;  /* Get the current DSM time. */

    /* Compute the remaining sleep period. */
    if (mPWR_AbsoluteWakeupTimeInDsmTicks != mPWR_DSM_InvalidTime_c)
    {
        if (currentDsmTime < mPWR_AbsoluteWakeupTimeInDsmTicks)
        {
            durationInDsmTicks = mPWR_AbsoluteWakeupTimeInDsmTicks - currentDsmTime;
        }
        else
        {
            durationInDsmTicks = mPWR_DSM_MaxTimeCount_c - currentDsmTime + mPWR_AbsoluteWakeupTimeInDsmTicks;
        }
    }

    dsmOscOffset = 1024 << READ_REGISTER_FIELD(RSIM->RF_OSC_CTRL,RSIM_RF_OSC_CTRL_BB_XTAL_READY_COUNT_SEL);
    dsmOscOffset = (dsmOscOffset << 15)/BOARD_BOOTCLOCKRUN_CORE_CLOCK;

    if(durationInDsmTicks > dsmOscOffset)
    {
        uint32_t dsmSleep;

        RSIM->DSM_OSC_OFFSET = dsmOscOffset;
        dsmSleep = (RSIM->DSM_TIMER + 5) & mPWR_DSM_TimerMask_c;
        RSIM->GEN_SLEEP = dsmSleep;
        RSIM->GEN_WAKE = mPWR_AbsoluteWakeupTimeInDsmTicks;
        GENFSK->DSM_CTRL = GENFSK_DSM_CTRL_GEN_SLEEP_REQUEST_MASK;
        retVal = TRUE;
    }

    return retVal;
}
#endif /* ((cPWR_UsePowerDownMode) && (cPWR_GENFSK_LL_Enable)) */

/*---------------------------------------------------------------------------
 * Name: PWR_HandleGenfskDsmExit
 * Description: -
 * Parameters: -
 * Return: -
 *---------------------------------------------------------------------------*/
#if ((cPWR_UsePowerDownMode) && (cPWR_GENFSK_LL_Enable))
static void PWR_HandleGenfskDsmExit(void)
{
    if(READ_REGISTER_FIELD(RSIM->DSM_CONTROL,RSIM_DSM_CONTROL_GEN_SLEEP_REQUEST))
    {
        uint32_t remainTicksToSleep;
        uint32_t dsmTimer = RSIM->DSM_TIMER;

        remainTicksToSleep = RSIM->GEN_WAKE;
        remainTicksToSleep = (remainTicksToSleep - dsmTimer) & mPWR_DSM_TimerMask_c;

        if(remainTicksToSleep > 5)
        {
            RSIM->GEN_WAKE = (dsmTimer + 5) & mPWR_DSM_TimerMask_c;
        }
    }
}
#endif /* ((cPWR_UsePowerDownMode) && (cPWR_GENFSK_LL_Enable)) */
/*---------------------------------------------------------------------------
 * Name: PWR_HandleDeepSleepMode_1
 * Description: -
 * Parameters: -
 * Return: -
 *---------------------------------------------------------------------------*/
#if (cPWR_UsePowerDownMode && cPWR_EnableDeepSleepMode_1)
static void PWR_HandleDeepSleepMode_1(void)
{
#if cPWR_BLE_LL_Enable
#if (gTMR_EnableLowPowerTimers_d)
    uint32_t notCountedTicksBeforeSleep = 0;
#endif /* (gTMR_EnableLowPowerTimers_d) */
    uint32_t lptmrFreq;
    uint32_t sysTickCtrl;
    bool_t enterLowPower = !RSIM_CONTROL_READ_FIELD(RSIM_CONTROL_RSIM_DSM_EXIT);
    bool_t dsmExit = FALSE;

    if(enterLowPower)
    {
        /* Disable SysTick counter and interrupt */
        sysTickCtrl = SysTick->CTRL & (SysTick_CTRL_ENABLE_Msk | SysTick_CTRL_TICKINT_Msk);
        SysTick->CTRL &= ~(SysTick_CTRL_ENABLE_Msk | SysTick_CTRL_TICKINT_Msk);

        lptmrFreq = PWR_ProgramDeepSleepTime();

