Masmiseim36/nxpSDK/middleware/wireless/framework_5.4.6/LowPower/Source/MKW36Z/PWR.c
        PWRLib_MCU_WakeupReason.AllBits = 0;

#if (gTMR_EnableLowPowerTimers_d)
        /* If more low power timers are running, stop the hardware timer
        * and save the spend time in ticks that wasn't counted.
        */
        notCountedTicksBeforeSleep = TMR_NotCountedTicksBeforeSleep();
#endif /* (gTMR_EnableLowPowerTimers_d) */

        PWR_CheckBLE_LL_state(&enterLowPower, &dsmExit);

        if(enterLowPower)
        {
            uint32_t rfOscEn;

            if(gpfPWR_LowPowerEnterCb != NULL)
            {
                gpfPWR_LowPowerEnterCb();
            }

            BOARD_BLPEtoBLPI();
            rfOscEn =  RSIM_CONTROL_READ_FIELD(RSIM_CONTROL_RF_OSC_EN);
            RSIM->CONTROL = RSIM_CONTROL_MODIFY_FIELD(RSIM_CONTROL_RF_OSC_EN, 0);
            PWRLib_MCU_Enter_LLS3();
            RSIM->CONTROL = RSIM_CONTROL_MODIFY_FIELD(RSIM_CONTROL_RF_OSC_EN, rfOscEn);
            BOARD_BLPItoBLPE();

            if(gpfPWR_LowPowerExitCb != NULL)
            {
                gpfPWR_LowPowerExitCb();
            }

            PWRLib_LLWU_UpdateWakeupReason();
        }

        PWRLib_LPTMR_ClockStop();

        /* Sync. the low power timers */
#if (gTMR_EnableLowPowerTimers_d)
        PWR_SyncTimers(notCountedTicksBeforeSleep, lptmrFreq);
#endif /* (gTMR_EnableLowPowerTimers_d) */
        if(dsmExit)
        {
            if(RSIM_CONTROL_READ_FIELD(RSIM_CONTROL_BLE_RF_OSC_REQ_INT) == 0)
            {
                RSIM->CONTROL = RSIM_CONTROL_MODIFY_FIELD(RSIM_CONTROL_RSIM_DSM_EXIT, 1);
            }
            while((BLE_LL_REG(EVENT_STATUS) & BLE_LL_EVENT_STATUS_DSM_INT_MASK) == 0)
            {
            }
        }

        SysTick->CTRL |= sysTickCtrl;
    }

#else
    PWRLib_MCU_WakeupReason.AllBits = 0;
#endif /* cPWR_BLE_LL_Enable */
}
#endif /* (cPWR_UsePowerDownMode && cPWR_EnableDeepSleepMode_1) */

/*---------------------------------------------------------------------------
 * Name: PWR_HandleDeepSleepMode_2_3
 * Description: -
 * Parameters: -
 * Return: -
 *---------------------------------------------------------------------------*/
#if (cPWR_UsePowerDownMode && (cPWR_EnableDeepSleepMode_2 || cPWR_EnableDeepSleepMode_3))
static void PWR_HandleDeepSleepMode_2_3(void)
{
#if (gTMR_EnableLowPowerTimers_d)
    uint32_t notCountedTicksBeforeSleep = 0;
#endif
    uint32_t lptmrFreq;
#if cPWR_BLE_LL_Enable
    uint16_t bleEnabledInt;
#endif

    PWRLib_MCU_WakeupReason.AllBits = 0;

#if cPWR_BLE_LL_Enable
    if(RSIM_CONTROL_READ_FIELD(RSIM_CONTROL_BLE_RF_OSC_REQ_STAT) == 0)  /* BLL in DSM */
    {
        return;
    }
#endif

    lptmrFreq = PWR_ProgramDeepSleepTime();

#if (gTMR_EnableLowPowerTimers_d)
    /* if more low power timers are running, stop the hardware timer
    and save the spend time in ticks that wasn't counted.  */
    notCountedTicksBeforeSleep = TMR_NotCountedTicksBeforeSleep();
#endif

#if cPWR_BLE_LL_Enable
    /* At this point the BLE_LL should be in idle state. BLE stack should assure that
    before allowing device to sleep */
    bleEnabledInt = PWRLib_BLL_GetIntEn();
    PWRLib_BLL_ClearInterrupts(bleEnabledInt);
    PWRLib_BLL_DisableInterrupts(bleEnabledInt);
#endif

    if(gpfPWR_LowPowerEnterCb != NULL)
    {
        gpfPWR_LowPowerEnterCb();
    }

    {
        uint32_t rfOscEn;
        uint8_t lpMode;

        lpMode = PWRLib_GetDeepSleepMode();

        BOARD_BLPEtoBLPI();

        rfOscEn =  RSIM_CONTROL_READ_FIELD(RSIM_CONTROL_RF_OSC_EN);
        RSIM->CONTROL = RSIM_CONTROL_MODIFY_FIELD(RSIM_CONTROL_RF_OSC_EN, 0);

        if(lpMode == 2)
        {
            PWRLib_MCU_Enter_LLS2();
        }
        else
        {
            PWRLib_MCU_Enter_LLS3();
        }

        RSIM->CONTROL = RSIM_CONTROL_MODIFY_FIELD(RSIM_CONTROL_RF_OSC_EN, rfOscEn);
        BOARD_BLPItoBLPE();
    }

    if(gpfPWR_LowPowerExitCb != NULL)
    {
        gpfPWR_LowPowerExitCb();
    }

    PWRLib_LLWU_UpdateWakeupReason();
#if cPWR_BLE_LL_Enable
    PWRLib_BLL_EnableInterrupts(bleEnabledInt);
#endif
    PWRLib_LPTMR_ClockStop();

    /* Sync. the low power timers */
#if (gTMR_EnableLowPowerTimers_d)
    PWR_SyncTimers(notCountedTicksBeforeSleep, lptmrFreq);
#endif
}
#endif

/*---------------------------------------------------------------------------
 * Name: PWR_HandleDeepSleepMode_4
 * Description: -
 * Parameters: -
 * Return: -
 *---------------------------------------------------------------------------*/
#if (cPWR_UsePowerDownMode && cPWR_EnableDeepSleepMode_4)
static void PWR_HandleDeepSleepMode_4(void)
{
#if cPWR_BLE_LL_Enable
    uint16_t bleEnabledInt;
#endif
    PWRLib_MCU_WakeupReason.AllBits = 0;

#if cPWR_BLE_LL_Enable
    if(RSIM_CONTROL_READ_FIELD(RSIM_CONTROL_BLE_RF_OSC_REQ_STAT) == 0)  /* BLL in DSM */
    {
        return;
    }

    bleEnabledInt = PWRLib_BLL_GetIntEn();
    PWRLib_BLL_ClearInterrupts(bleEnabledInt);
    PWRLib_BLL_DisableInterrupts(bleEnabledInt);
#endif

    if(gpfPWR_LowPowerEnterCb != NULL)
    {
        gpfPWR_LowPowerEnterCb();
    }

    {
        uint32_t rfOscEn;

        BOARD_BLPEtoBLPI();

        rfOscEn =  RSIM_CONTROL_READ_FIELD(RSIM_CONTROL_RF_OSC_EN);
        RSIM->CONTROL = RSIM_CONTROL_MODIFY_FIELD(RSIM_CONTROL_RF_OSC_EN, 0);

#if cPWR_DCDC_InBypass
        PWRLib_MCU_Enter_VLLSx(0);
#else
        PWRLib_MCU_Enter_VLLSx(1);
#endif

        RSIM->CONTROL = RSIM_CONTROL_MODIFY_FIELD(RSIM_CONTROL_RF_OSC_EN, rfOscEn);
        BOARD_BLPItoBLPE();
    }

    if(gpfPWR_LowPowerExitCb != NULL)
    {
        gpfPWR_LowPowerExitCb();
    }

#if cPWR_BLE_LL_Enable
    PWRLib_BLL_EnableInterrupts(bleEnabledInt);
#endif
}
#endif

/*---------------------------------------------------------------------------
 * Name: PWR_HandleDeepSleepMode_5
 * Description: -
 * Parameters: -
 * Return: -
 *---------------------------------------------------------------------------*/
#if (cPWR_UsePowerDownMode && cPWR_EnableDeepSleepMode_5)
static void PWR_HandleDeepSleepMode_5(void)
{
#if cPWR_BLE_LL_Enable
    uint16_t bleEnabledInt;
#endif
    PWRLib_MCU_WakeupReason.AllBits = 0;

#if cPWR_BLE_LL_Enable
    if(RSIM_CONTROL_READ_FIELD(RSIM_CONTROL_BLE_RF_OSC_REQ_STAT) == 0)  /* BLL in DSM */
    {
        return;
    }

    bleEnabledInt = PWRLib_BLL_GetIntEn();
    PWRLib_BLL_ClearInterrupts(bleEnabledInt);
    PWRLib_BLL_DisableInterrupts(bleEnabledInt);
#endif

    if(gpfPWR_LowPowerEnterCb != NULL)
    {
        gpfPWR_LowPowerEnterCb();
    }

    {
        uint32_t rfOscEn;

