Masmiseim36/nxpSDK/middleware/wireless/framework_5.4.6/LowPower/Source/MKW36Z/PWR.c
        BOARD_BLPEtoBLPI();

        rfOscEn =  RSIM_CONTROL_READ_FIELD(RSIM_CONTROL_RF_OSC_EN);
        RSIM->CONTROL = RSIM_CONTROL_MODIFY_FIELD(RSIM_CONTROL_RF_OSC_EN, 0);

#if (cPWR_RamRetentionInVLLS > 2)
        PWRLib_MCU_Enter_VLLSx(3);
#else
        PWRLib_MCU_Enter_VLLSx(2);
#endif

        RSIM->CONTROL = RSIM_CONTROL_MODIFY_FIELD(RSIM_CONTROL_RF_OSC_EN, rfOscEn);

        BOARD_BLPItoBLPE();
    }

    if(gpfPWR_LowPowerExitCb != NULL)
    {
        gpfPWR_LowPowerExitCb();
    }
    
    PWRLib_LLWU_UpdateWakeupReason();
#if cPWR_BLE_LL_Enable
    PWRLib_BLL_EnableInterrupts(bleEnabledInt);
#endif
}
#endif

/*---------------------------------------------------------------------------
 * Name: PWR_HandleDeepSleepMode_6
 * Description: -
 * Parameters: -
 * Return: -
 *---------------------------------------------------------------------------*/
#if (cPWR_UsePowerDownMode && cPWR_EnableDeepSleepMode_6)
static void PWR_HandleDeepSleepMode_6(void)
{

#if (gTMR_EnableLowPowerTimers_d)
    uint32_t notCountedTicksBeforeSleep = 0;
#endif
    uint32_t lptmrFreq;
    uint32_t sysTickCtrl;

    PWRLib_MCU_WakeupReason.AllBits = 0;

#if cPWR_BLE_LL_Enable
    if(RSIM_CONTROL_READ_FIELD(RSIM_CONTROL_BLE_RF_OSC_REQ_STAT) == 0)  /* BLL in DSM */
    {
        return;
    }
#endif

    lptmrFreq = PWR_ProgramDeepSleepTime();

#if (gTMR_EnableLowPowerTimers_d)
    /* If more low power timers are running, stop the hardware timer
     * and save the spend time in ticks that wasn't counted.
     */
    notCountedTicksBeforeSleep = TMR_NotCountedTicksBeforeSleep();
#endif

    /* Disable SysTick counter and interrupt */
    sysTickCtrl = SysTick->CTRL & (SysTick_CTRL_ENABLE_Msk | SysTick_CTRL_TICKINT_Msk);
    SysTick->CTRL &= ~(SysTick_CTRL_ENABLE_Msk | SysTick_CTRL_TICKINT_Msk);

    {
        uint32_t rfOscEn = RSIM_CONTROL_READ_FIELD(RSIM_CONTROL_RF_OSC_EN);

        RSIM->CONTROL = RSIM_CONTROL_MODIFY_FIELD(RSIM_CONTROL_RF_OSC_EN, 0x3);

        BOARD_BLPEtoBLPI();

        RSIM->CONTROL |= RSIM_CONTROL_RSIM_STOP_ACK_OVRD_EN_MASK | RSIM_CONTROL_RSIM_STOP_ACK_OVRD_MASK;
        SIM->FCFG1 |= SIM_FCFG1_FLASHDOZE_MASK;

        PWRLib_MCU_Enter_Stop();
        SIM->FCFG1 &= ~SIM_FCFG1_FLASHDOZE_MASK;
        RSIM->CONTROL &= ~RSIM_CONTROL_RSIM_STOP_ACK_OVRD_EN_MASK;
        BOARD_BLPItoBLPE();
        RSIM->CONTROL = RSIM_CONTROL_MODIFY_FIELD(RSIM_CONTROL_RF_OSC_EN, rfOscEn);
    }

    /* Restore the state of SysTick */
    SysTick->CTRL |= sysTickCtrl;
    /* Checks sources of wakeup */
    PWRLib_StopUpdateWakeupReason();
    PWRLib_LPTMR_ClockStop();

    /* Sync. the low power timers */
#if (gTMR_EnableLowPowerTimers_d)
    PWR_SyncTimers(notCountedTicksBeforeSleep, lptmrFreq);
#endif
}
#endif

/*---------------------------------------------------------------------------
 * Name: PWR_HandleDeepSleepMode_7
 * Description: -
 * Parameters: -
 * Return: -
 *---------------------------------------------------------------------------*/
#if (cPWR_UsePowerDownMode && cPWR_EnableDeepSleepMode_7)
static void PWR_HandleDeepSleepMode_7(void)
{
#if (cPWR_GENFSK_LL_Enable)
#if (gTMR_EnableLowPowerTimers_d)
    uint32_t notCountedTicksBeforeSleep= 0;
#endif
    uint32_t lptmrFreq;
    bool_t enterLowPower = TRUE;

    PWRLib_MCU_WakeupReason.AllBits = 0;

    lptmrFreq = PWR_ProgramDeepSleepTime();

#if (gTMR_EnableLowPowerTimers_d)
    /* If more low power timers are running, stop the hardware timer
     * and save the spend time in ticks that wasn't counted.
     */
    notCountedTicksBeforeSleep = TMR_NotCountedTicksBeforeSleep();
#endif

    if(enterLowPower && (READ_REGISTER_FIELD(RSIM->DSM_CONTROL,RSIM_DSM_CONTROL_GEN_SLEEP_REQUEST) == 0))
    {
        enterLowPower &= PWR_HandleGenfskDsmEnter();
    }

    if(enterLowPower)
    {
        uint32_t rfOscEn;

        if(gpfPWR_LowPowerEnterCb != NULL)
        {
            gpfPWR_LowPowerEnterCb();
        }

        BOARD_BLPEtoBLPI();

        rfOscEn =  RSIM_CONTROL_READ_FIELD(RSIM_CONTROL_RF_OSC_EN);
        RSIM->CONTROL = RSIM_CONTROL_MODIFY_FIELD(RSIM_CONTROL_RF_OSC_EN, 0);

        PWRLib_MCU_Enter_LLS3();

        RSIM->CONTROL = RSIM_CONTROL_MODIFY_FIELD(RSIM_CONTROL_RF_OSC_EN, rfOscEn);

        BOARD_BLPItoBLPE();

        if(gpfPWR_LowPowerExitCb != NULL)
        {
            gpfPWR_LowPowerExitCb();
        }

        PWRLib_LLWU_UpdateWakeupReason();

        PWR_HandleGenfskDsmExit();
    }

    PWRLib_LPTMR_ClockStop();

    /* Sync. the low power timers */
#if (gTMR_EnableLowPowerTimers_d)
    PWR_SyncTimers(notCountedTicksBeforeSleep, lptmrFreq);
#endif
#else
    PWRLib_MCU_WakeupReason.AllBits = 0;
#endif
}
#endif

/*---------------------------------------------------------------------------
 * Name: PWR_HandleDeepSleepMode_8
 * Description: -
 * Parameters: -
 * Return: -
 *---------------------------------------------------------------------------*/
#if (cPWR_UsePowerDownMode && cPWR_EnableDeepSleepMode_8)
static void PWR_HandleDeepSleepMode_8(void)
{
#if cPWR_BLE_LL_Enable
#if (gTMR_EnableLowPowerTimers_d)
    uint32_t notCountedTicksBeforeSleep = 0;
#endif /* (gTMR_EnableLowPowerTimers_d) */
    uint32_t lptmrFreq;
    uint32_t sysTickCtrl;
    bool_t enterLowPower = !RSIM_CONTROL_READ_FIELD(RSIM_CONTROL_RSIM_DSM_EXIT);
    bool_t dsmExit = FALSE;

    if(enterLowPower)
    {
        /* Disable SysTick counter and interrupt */
        sysTickCtrl = SysTick->CTRL & (SysTick_CTRL_ENABLE_Msk | SysTick_CTRL_TICKINT_Msk);
        SysTick->CTRL &= ~(SysTick_CTRL_ENABLE_Msk | SysTick_CTRL_TICKINT_Msk);

        PWRLib_MCU_WakeupReason.AllBits = 0;

        lptmrFreq = PWR_ProgramDeepSleepTime();

#if (gTMR_EnableLowPowerTimers_d)
        /* If more low power timers are running, stop the hardware timer
        * and save the spend time in ticks that wasn't counted.
        */
        notCountedTicksBeforeSleep = TMR_NotCountedTicksBeforeSleep();
#endif /* (gTMR_EnableLowPowerTimers_d) */

        PWR_CheckBLE_LL_state(&enterLowPower, &dsmExit);

        if(enterLowPower)
        {
            uint32_t rfOscEn;

            if(gpfPWR_LowPowerEnterCb != NULL)
            {
                gpfPWR_LowPowerEnterCb();
            }

