Masmiseim36/nxpSDK/middleware/wireless/framework_5.4.6/LowPower/Source/MKW36Z/PWR.c
            BOARD_BLPEtoBLPI();
            rfOscEn =  RSIM_CONTROL_READ_FIELD(RSIM_CONTROL_RF_OSC_EN);
            RSIM->CONTROL = RSIM_CONTROL_MODIFY_FIELD(RSIM_CONTROL_RF_OSC_EN, 0);
#if (cPWR_RamRetentionInVLLS > 2)
            PWRLib_MCU_Enter_VLLSx(3);
#else
            PWRLib_MCU_Enter_VLLSx(2);
#endif
            RSIM->CONTROL = RSIM_CONTROL_MODIFY_FIELD(RSIM_CONTROL_RF_OSC_EN, rfOscEn);
            BOARD_BLPItoBLPE();

            if(gpfPWR_LowPowerExitCb != NULL)
            {
                gpfPWR_LowPowerExitCb();
            }
            
            PWRLib_LLWU_UpdateWakeupReason();
        }

        PWRLib_LPTMR_ClockStop();

        /* Sync. the low power timers */
#if (gTMR_EnableLowPowerTimers_d)
        PWR_SyncTimers(notCountedTicksBeforeSleep, lptmrFreq);
#endif /* (gTMR_EnableLowPowerTimers_d) */
        if(dsmExit)
        {
            if(RSIM_CONTROL_READ_FIELD(RSIM_CONTROL_BLE_RF_OSC_REQ_INT) == 0)
            {
                RSIM->CONTROL = RSIM_CONTROL_MODIFY_FIELD(RSIM_CONTROL_RSIM_DSM_EXIT, 1);
            }
            while((BLE_LL_REG(EVENT_STATUS) & BLE_LL_EVENT_STATUS_DSM_INT_MASK) == 0)
            {
            }
        }

        SysTick->CTRL |= sysTickCtrl;
    }

#else
    PWRLib_MCU_WakeupReason.AllBits = 0;
#endif /* cPWR_BLE_LL_Enable */
}
#endif /* (cPWR_UsePowerDownMode && cPWR_EnableDeepSleepMode_8) */

/*---------------------------------------------------------------------------
 * Name: PWR_ProgramDeepSleepTime
 * Description: Program the next DeepSleep wakaup time
 * Parameters: - 
 * Return: - LPTMR frequency in Hz
 *---------------------------------------------------------------------------*/
#if (cPWR_UsePowerDownMode)
static uint32_t PWR_ProgramDeepSleepTime(void)
{
    uint8_t clkMode;
    uint32_t lptmrTicks;
    uint32_t lptmrFreq;
    uint32_t sleepTimeMs;
    
#if (gTMR_EnableLowPowerTimers_d) && (cPWR_CheckLowPowerTimers)
    /* Get the expire time of the first programmed Low Power Timer */
    sleepTimeMs = TMR_GetFirstExpireTime(gTmrLowPowerTimer_c);
    
    if(mPWR_DeepSleepTimeMs < sleepTimeMs)
#endif /* (gTMR_EnableLowPowerTimers_d) && (cPWR_CheckLowPowerTimers) */
    {
        sleepTimeMs = mPWR_DeepSleepTimeMs;
    }

    PWRLib_LPTMR_GetTimeSettings(sleepTimeMs ,&clkMode ,&lptmrTicks, &lptmrFreq);
    PWRLib_LPTMR_ClockStart(clkMode,lptmrTicks);
    
    return lptmrFreq;
}
#endif

/*---------------------------------------------------------------------------
 * Name: PWR_SyncTimers
 * Description: Synchronize the framework timers with the amount of time in LP
 * Parameters: - notCountedTicksBeforeSleep: 
 *             - lptmrFreq: 
 * Return: -
 *---------------------------------------------------------------------------*/
#if (cPWR_UsePowerDownMode) && (gTMR_EnableLowPowerTimers_d)
static void PWR_SyncTimers(uint32_t notCountedTicksBeforeSleep, uint32_t lptmrFreq)
{
    uint64_t timerTicks = PWRLib_LPTMR_ClockCheck();
    mLpmTotalSleepDuration += timerTicks * 1000000 / lptmrFreq;
    timerTicks = (timerTicks * TMR_GetTimerFreq()) / lptmrFreq;
    timerTicks += notCountedTicksBeforeSleep;
    TMR_SyncLpmTimers((uint32_t)timerTicks);
}
#endif

/*---------------------------------------------------------------------------
 * Name: PWR_CheckBLE_LL_state
 * Description: Checks whether the BLE link layer allows to enter low power state
 * Parameters: - enterLowPower: TRUE if low power mode alowed
 *             - dsmExit: TRUE if manual DSM exit is required
 * Return: -
 *---------------------------------------------------------------------------*/
#if (cPWR_UsePowerDownMode) && (cPWR_BLE_LL_Enable)
static void PWR_CheckBLE_LL_state(bool_t * enterLowPower, bool_t * dsmExit)
{
    if(RSIM_CONTROL_READ_FIELD(RSIM_CONTROL_BLE_RF_OSC_REQ_STAT)) /* If false it means that BLE_LL is already in DSM */
    {
        uint16_t distanceToNextInstant;
        uint16_t nextInstant = 0;
        uint16_t offsetBeforeDsmExit;
        
        if(BLE_LL_REG(CLOCK_CONFIG) & BLE_LL_CLOCK_CONFIG_LLH_IDLE_MASK)
        {
            distanceToNextInstant = PWR_BLE_GetNearestInstant(&nextInstant);
            offsetBeforeDsmExit = PWRLib_BLL_GetOffsetSlotsBeforeDsmExit();
            
            if(distanceToNextInstant > offsetBeforeDsmExit + 1)
            {
                if(VECTOR_PENDING == 0)
                {
                    PWRLib_BLL_SetWakeupInstant(nextInstant);
                    PWRLib_BLL_EnterDSM();
                    *dsmExit = TRUE;
                }
                else
                {
                    *enterLowPower = FALSE;
                }
                
            }
            else
            {
                *enterLowPower = FALSE;
            }
        }
        else
        {
            *enterLowPower = FALSE;
        }
    }
    else
    {
        *enterLowPower = (VECTOR_PENDING == 0);
    }
}
#endif

/*---------------------------------------------------------------------------
 * Name: PWR_HandleDeepSleep
 * Description: -
 * Parameters: -
 * Return: -
 *---------------------------------------------------------------------------*/
#if (cPWR_UsePowerDownMode)
static PWRLib_WakeupReason_t PWR_HandleDeepSleep(void)
{
    PWRLib_MCU_WakeupReason.AllBits = 0;
    {
        uint8_t lpMode;

        lpMode = PWRLib_GetDeepSleepMode();

        if(lpMode)
        {
            if(maHandleDeepSleep[lpMode - 1])
            {
                maHandleDeepSleep[lpMode - 1]();
            }
        }
    }

    return PWRLib_MCU_WakeupReason;
}
#endif

/*---------------------------------------------------------------------------
 * Name: PWR_HandleSleep
 * Description: -
 * Parameters: -
 * Return: -
 *---------------------------------------------------------------------------*/
#if (cPWR_UsePowerDownMode)
static PWRLib_WakeupReason_t PWR_HandleSleep(void)
{
    PWRLib_WakeupReason_t  Res;

    Res.AllBits = 0;

/*---------------------------------------------------------------------------*/
#if (cPWR_SleepMode == 0)
    return Res;

